# Загальне завдання: арифметичні операції над двома числами

# Зчитування двох чисел з клавіатури та перетворення їх у тип float
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))

# Обчислення суми, різниці та добутку
sum_res = num1 + num2
diff_res = num1 - num2
mult_res = num1 * num2

# Виведення результатів обчислень на екран
print(f"Сума: {sum_res}")
print(f"Різниця: {diff_res}")
print(f"Добуток: {mult_res}")

# Перевірка на нуль перед виконанням ділення
if num2 != 0:
    div_res = num1 / num2
    print(f"Частка: {div_res}")
else:
    print("Ділення на нуль неможливе!")
